wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_sdio.h
/*!
    \file    gd32h77x_sdio.h
    \brief   definitions for the SDIO

    \version 2025-09-29, V0.2.0, firmware for GD32H77x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32H77X_SDIO_H
#define GD32H77X_SDIO_H

#include "gd32h77x.h"

/* SDIO definitions */
#define SDIO0                           (SDIO_BASE + 0x09FE4C00U)
#define SDIO1                           (SDIO_BASE)

/* registers definitions */
#define SDIO_PWRCTL(sdiox)              REG32((sdiox) + 0x00000000U)   /*!< SDIO power control register */
#define SDIO_CLKCTL(sdiox)              REG32((sdiox) + 0x00000004U)   /*!< SDIO clock control register */
#define SDIO_CMDAGMT(sdiox)             REG32((sdiox) + 0x00000008U)   /*!< SDIO command argument register */
#define SDIO_CMDCTL(sdiox)              REG32((sdiox) + 0x0000000CU)   /*!< SDIO command control register */
#define SDIO_RSPCMDIDX(sdiox)           REG32((sdiox) + 0x00000010U)   /*!< SDIO command index response register */
#define SDIO_RESP0(sdiox)               REG32((sdiox) + 0x00000014U)   /*!< SDIO response register 0 */
#define SDIO_RESP1(sdiox)               REG32((sdiox) + 0x00000018U)   /*!< SDIO response register 1 */
#define SDIO_RESP2(sdiox)               REG32((sdiox) + 0x0000001CU)   /*!< SDIO response register 2 */
#define SDIO_RESP3(sdiox)               REG32((sdiox) + 0x00000020U)   /*!< SDIO response register 3 */
#define SDIO_DATATO(sdiox)              REG32((sdiox) + 0x00000024U)   /*!< SDIO data timeout register */
#define SDIO_DATALEN(sdiox)             REG32((sdiox) + 0x00000028U)   /*!< SDIO data length register */
#define SDIO_DATACTL(sdiox)             REG32((sdiox) + 0x0000002CU)   /*!< SDIO data control register */
#define SDIO_DATACNT(sdiox)             REG32((sdiox) + 0x00000030U)   /*!< SDIO data counter register */
#define SDIO_STAT(sdiox)                REG32((sdiox) + 0x00000034U)   /*!< SDIO status register */
#define SDIO_INTC(sdiox)                REG32((sdiox) + 0x00000038U)   /*!< SDIO interrupt clear register */
#define SDIO_INTEN(sdiox)               REG32((sdiox) + 0x0000003CU)   /*!< SDIO interrupt enable register */
#define SDIO_ACKTO(sdiox)               REG32((sdiox) + 0x00000040U)   /*!< SDIO FIFO ACK timeout register */
#define SDIO_FIFO(sdiox)                REG32((sdiox) + 0x00000080U)   /*!< SDIO FIFO data register */
#define SDIO_IDMACTL(sdiox)             REG32((sdiox) + 0x00000050U)   /*!< SDIO FIFO internal DMA control register */
#define SDIO_IDMASIZE(sdiox)            REG32((sdiox) + 0x00000054U)   /*!< SDIO FIFO internal DMA buffer size register */
#define SDIO_IDMAADDR0(sdiox)           REG32((sdiox) + 0x00000058U)   /*!< SDIO FIFO internal DMA buffer 0 base address register */
#define SDIO_IDMAADDR1(sdiox)           REG32((sdiox) + 0x0000005CU)   /*!< SDIO FIFO internal DMA buffer 1 base address register */

/* bits definitions */
/* SDIO_PWRCTL */
#define SDIO_PWRCTL_PWRCTL              BITS(0,1)              /*!< SDIO power control bits */
#define SDIO_PWRCTL_VSSTART             BIT(2)                 /*!< voltage switch start bit */
#define SDIO_PWRCTL_VSEN                BIT(3)                 /*!< voltage switch enable bit */
#define SDIO_PWRCTL_DIRPS               BIT(4)                 /*!< data and command direction polarity selection bit */

/* SDIO_CLKCTL */
#define SDIO_CLKCTL_DIV                 BITS(0,9)              /*!< clock division */
#define SDIO_CLKCTL_CLKPWRSAV           BIT(12)                /*!< SDIO_CLK clock dynamic switch on/off for power saving */
#define SDIO_CLKCTL_BUSMODE             BITS(14,15)            /*!< SDIO card bus mode control bit */
#define SDIO_CLKCTL_CLKEDGE             BIT(16)                /*!< command and data SDIO_CLK dephasing selection bit */
#define SDIO_CLKCTL_HWEN                BIT(17)                /*!< hardware flow control enable bit */
#define SDIO_CLKCTL_DRSEL               BIT(18)                /*!< data rate selection bit */
#define SDIO_CLKCTL_BUSSP               BIT(19)                /*!< bus speed mode selection bit */
#define SDIO_CLKCTL_RCLK                BITS(20,21)            /*!< receive clock selection bits */

/* SDIO_CMDAGMT */
#define SDIO_CMDAGMT_CMDAGMT            BITS(0,31)             /*!< SDIO card command argument */

/* SDIO_CMDCTL */
#define SDIO_CMDCTL_CMDIDX              BITS(0,5)              /*!< command index */
#define SDIO_CMDCTL_TREN                BIT(6)                 /*!< data transfer mode enable bit */
#define SDIO_CMDCTL_TRSTOP              BIT(7)                 /*!< data transfer stop bit */
#define SDIO_CMDCTL_CMDRESP             BITS(8,9)              /*!< waits command response type bits */
#define SDIO_CMDCTL_INTWAIT             BIT(10)                /*!< interrupt wait instead of timeout */
#define SDIO_CMDCTL_WAITDEND            BIT(11)                /*!< waits for ends of data transfer */
#define SDIO_CMDCTL_CSMEN               BIT(12)                /*!< command state machine (CSM) enable bit */
#define SDIO_CMDCTL_HOLD                BIT(13)                /*!< hold DSM transmission and reception of new data block */
#define SDIO_CMDCTL_BOOTMOD             BIT(14)                /*!< boot mode selection bit */
#define SDIO_CMDCTL_BOOTMODEN           BIT(15)                /*!< boot mode procedure enable bit */
#define SDIO_CMDCTL_CMDSR               BIT(16)                /*!< suspend or resume command and signals interrupt period start/end bit */

/* SDIO_DATATO */
#define SDIO_DATATO_DATATO              BITS(0,31)             /*!< data timeout period */

